app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hiya there"], ["created_at", Thu, 10 Apr 2014 01:40:33 UTC +00:00], ["title", "test"], ["updated_at", Thu, 10 Apr 2014 01:40:33 UTC +00:00]]